<?php
/**
 * Created by PhpStorm.
 * User: lester
 * Date: 2018/12/17 2:31
 * Desc:
 */
return [
    '2600' => '单位转换失败',


    '2620' => '导出失败',
    '2621' => '获取BOM单位失败，请到SAP完善并同步主数据后再试',

    //合并领料单
    '2650' => '当前领料单不可以撤回',
    '2651' => '撤回失败，请稍后再试',
    '2652' => '请选择同属一个车间的工单',
    '2653' => '所选工单不需要向SAP领料',
    '2654' => '当前为合并领料单，不允许删除',
    '2655' => '该合并领或退料单已推送，不允许删除',
    '2656' => '该料已经发送给领料仓',
    '2657' => '库存不足，请重新发料',
    '2658' => '该行项已收料无法删除',
    '2659' => '不存在的领料单',
    '2660' => '该领料单已收料，无法删除',
    '2661' => '不存在的领料单行项',
    '2662' => '请选择同属一个销售单的委外订单',
    '2663' => '选择的委外订单找不到对应工单',
    '2664' => '工单状态异常，无法进行退料！',
    '2665' => '请选择通用库存的物料！',
    '2666' => '存在非通用库存的物料，无法进行合并退料！',
    '2667' => '流转品或者线边仓管理的料无法进行退料！',
    '2668' => '当前领料单没有需要删除的行项',
];