<?php 
/**
 *8000-9000  为仓库的所有错误编码
 *8000-8300  为仓库基础设置错误编码
 *8301-9000  为仓库业务设置错误编码
 */
return [
    //storage  inve
    '8601' => '物料不存在！',
    '8602' => '该物料已经全部出库！',
    '8603' => '该物料可用库存不足！',
    '8604' => '实时库存不存在，请重新选择！',
    '8605' => '入库数小于目前数！',
    '8606' => '不存在该物料的入库记录！',
    '8607' => '数据有问题！',
    '8608' => '不存在该实时库存！',
    '8609' => '迁出数量大于实时库存数量！',
    '8610' => '存在空的参数！',
    '8611' => '签转条目为空',
    '8612' => '签转参数不是数组！',
    '8613' => '签转失败，库存已被占用',
    '8614' => '签转数量有误或小于实时库存数',
];





